In [45]:
import pandas as pd
import numpy as np

In [46]:
df = pd.read_csv('student_performance.csv')
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0        S0001   15    Male     12                   65.0         NaN
1        S0002   19  Female      9                   58.0        80.0
2        S0003   14  Female     12                    NaN        83.0
3        S0004   18  Female      9                   68.0        68.0
4        S0005   14    Male     10                   80.0        41.0
..         ...  ...     ...    ...                    ...         ...
143      S0144   14    Male     11                   94.0         NaN
144      S0145   19    Male     12                   56.0        83.0
145      S0146   19  Female     12                    NaN        51.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
0              NaN           72.0             50.33
1             44.0           35.0             53.00
2             73.0           59.0             71.67
3              NaN           77.0             64.33
4              NaN           36.0             41.00
..             ...            ...               ...
143            NaN           82.0             64.33
144            NaN           97.0             93.00
145           48.0           44.0             47.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[148 rows x 9 columns]

In [47]:
# to get the shape of columns
print(df.shape[1])

9

In [48]:
# to get the shape of rows
print(df.shape[0])

148

In [49]:
# checking whether there is null values or not in the DataFrame for that we can use two methods both are same and gives same output
print(df.isnull())

     Student_ID    Age  Gender  Class  Attendance_Percentage  Math_Score  \
0         False  False   False  False                  False        True
1         False  False   False  False                  False       False
2         False  False   False  False                   True       False
3         False  False   False  False                  False       False
4         False  False   False  False                  False       False
..          ...    ...     ...    ...                    ...         ...
143       False  False   False  False                  False        True
144       False  False   False  False                  False       False
145       False  False   False  False                   True       False
146       False  False   False  False                  False       False
147       False  False   False  False                  False       False

     Science_Score  English_Score  Final_Percentage
0             True          False             False
1            False          False             False
2            False          False             False
3             True          False             False
4             True          False             False
..             ...            ...               ...
143           True          False             False
144           True          False             False
145          False          False             False
146          False          False             False
147          False          False             False

[148 rows x 9 columns]

In [50]:
print(df.isna())

     Student_ID    Age  Gender  Class  Attendance_Percentage  Math_Score  \
0         False  False   False  False                  False        True
1         False  False   False  False                  False       False
2         False  False   False  False                   True       False
3         False  False   False  False                  False       False
4         False  False   False  False                  False       False
..          ...    ...     ...    ...                    ...         ...
143       False  False   False  False                  False        True
144       False  False   False  False                  False       False
145       False  False   False  False                   True       False
146       False  False   False  False                  False       False
147       False  False   False  False                  False       False

     Science_Score  English_Score  Final_Percentage
0             True          False             False
1            False          False             False
2            False          False             False
3             True          False             False
4             True          False             False
..             ...            ...               ...
143           True          False             False
144           True          False             False
145          False          False             False
146          False          False             False
147          False          False             False

[148 rows x 9 columns]

In [51]:
# if we .sum on the null values it will give us the count of null values in each column
print(df.isnull().sum())

Student_ID                0
Age                       0
Gender                    0
Class                     0
Attendance_Percentage    20
Math_Score               18
Science_Score            29
English_Score            16
Final_Percentage         14
dtype: int64

In [52]:
print(df.isna().sum())

Student_ID                0
Age                       0
Gender                    0
Class                     0
Attendance_Percentage    20
Math_Score               18
Science_Score            29
English_Score            16
Final_Percentage         14
dtype: int64

In [53]:
# tho drop the columns which have null values we can use dropna() method
df.dropna(inplace=True) # inplace=True will make the changes in the original DataFrame
# if we use df.dropna() without inplace=True it will return a new DataFrame with the dropped columns but the original DataFrame will remain unchanged
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
1        S0002   19  Female      9                   58.0        80.0
7        S0008   18  Female     11                   81.0        93.0
11       S0012   18  Female      9                   74.0        54.0
18       S0019   14  Female     12                  100.0        45.0
22       S0023   19  Female     12                   72.0        72.0
..         ...  ...     ...    ...                    ...         ...
136      S0137   19    Male     12                   83.0        81.0
139      S0140   14    Male     12                   85.0        56.0
141      S0142   16  Female      9                   60.0        97.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
1             44.0           35.0             53.00
7             37.0           48.0             59.33
11            38.0           59.0             50.33
18            85.0           74.0             68.00
22            40.0           63.0             58.33
..             ...            ...               ...
136           93.0           73.0             82.33
139           90.0           86.0             77.33
141           77.0           41.0             71.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[74 rows x 9 columns]

Using inplace=True in pandas is a way to modify the original DataFrame or Series directly without creating a new object in memory. The primary reasons for using it are to update the original variable and, in some rare cases, to potentially save memory when working with very large datasets

In [54]:
# if you want to remove the rows containing null values we can use axis = 0 in the dropna() method
# as we have already removed the rows containing null values in the previous example so there is no change in the DataFrame
# if we didnt specify the axis parameter it will remove the rows containing null values by default
df.dropna(inplace=True,axis = 0)
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
1        S0002   19  Female      9                   58.0        80.0
7        S0008   18  Female     11                   81.0        93.0
11       S0012   18  Female      9                   74.0        54.0
18       S0019   14  Female     12                  100.0        45.0
22       S0023   19  Female     12                   72.0        72.0
..         ...  ...     ...    ...                    ...         ...
136      S0137   19    Male     12                   83.0        81.0
139      S0140   14    Male     12                   85.0        56.0
141      S0142   16  Female      9                   60.0        97.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
1             44.0           35.0             53.00
7             37.0           48.0             59.33
11            38.0           59.0             50.33
18            85.0           74.0             68.00
22            40.0           63.0             58.33
..             ...            ...               ...
136           93.0           73.0             82.33
139           90.0           86.0             77.33
141           77.0           41.0             71.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[74 rows x 9 columns]

In [55]:
df.dropna(inplace=True,axis = 1)
# if you want to remove the columns containing null values we can use axis = 1 in the dropna() method
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
1        S0002   19  Female      9                   58.0        80.0
7        S0008   18  Female     11                   81.0        93.0
11       S0012   18  Female      9                   74.0        54.0
18       S0019   14  Female     12                  100.0        45.0
22       S0023   19  Female     12                   72.0        72.0
..         ...  ...     ...    ...                    ...         ...
136      S0137   19    Male     12                   83.0        81.0
139      S0140   14    Male     12                   85.0        56.0
141      S0142   16  Female      9                   60.0        97.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
1             44.0           35.0             53.00
7             37.0           48.0             59.33
11            38.0           59.0             50.33
18            85.0           74.0             68.00
22            40.0           63.0             58.33
..             ...            ...               ...
136           93.0           73.0             82.33
139           90.0           86.0             77.33
141           77.0           41.0             71.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[74 rows x 9 columns]

In [56]:
# here is another example by using axis = 1 to drop the columns containing null values
df = pd.DataFrame({'A': [1, 2, np.nan], 'B': [4, None, 6]})
print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [57]:
# you can drop null values from specific column by using subset parameter
df = pd.read_csv('student_performance.csv')
df.dropna(subset=['Math_Score'], inplace=True)
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
1        S0002   19  Female      9                   58.0        80.0
2        S0003   14  Female     12                    NaN        83.0
3        S0004   18  Female      9                   68.0        68.0
4        S0005   14    Male     10                   80.0        41.0
5        S0006   19    Male     12                   82.0        88.0
..         ...  ...     ...    ...                    ...         ...
141      S0142   16  Female      9                   60.0        97.0
144      S0145   19    Male     12                   56.0        83.0
145      S0146   19  Female     12                    NaN        51.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
1             44.0           35.0             53.00
2             73.0           59.0             71.67
3              NaN           77.0             64.33
4              NaN           36.0             41.00
5             70.0            NaN             68.00
..             ...            ...               ...
141           77.0           41.0             71.67
144            NaN           97.0             93.00
145           48.0           44.0             47.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[130 rows x 9 columns]

In [58]:
# you can drop null values from specific column by using subset parameter
x = pd.DataFrame({'A': [1, np.nan, 3], 'B': [4, 5, None]})
print(x)
print('\n')
print(x.dropna(subset=['A']))

     A    B
0  1.0  4.0
1  NaN  5.0
2  3.0  NaN


     A    B
0  1.0  4.0
2  3.0  NaN

In [59]:
# here is the example with using inplace = True and without using inplace = True
y = pd.DataFrame({'X': [1, np.nan, 3], 'Y': [np.nan, 5, 6]})
y.dropna(inplace=True)
print(y)

     X    Y
2  3.0  6.0

In [60]:
y = pd.DataFrame({'X': [1, np.nan, 3], 'Y': [np.nan, 5, 6]})
y.dropna()
print(y)

     X    Y
0  1.0  NaN
1  NaN  5.0
2  3.0  6.0

In [61]:
# here we are replacing null values with a specific value for that we will use fillna() method
df = pd.read_csv('student_performance.csv')
df.fillna(40,inplace = True)
print(df)

    Student_ID  Age  Gender  Class  Attendance_Percentage  Math_Score  \
0        S0001   15    Male     12                   65.0        40.0
1        S0002   19  Female      9                   58.0        80.0
2        S0003   14  Female     12                   40.0        83.0
3        S0004   18  Female      9                   68.0        68.0
4        S0005   14    Male     10                   80.0        41.0
..         ...  ...     ...    ...                    ...         ...
143      S0144   14    Male     11                   94.0        40.0
144      S0145   19    Male     12                   56.0        83.0
145      S0146   19  Female     12                   40.0        51.0
146      S0147   19    Male     11                   54.0        96.0
147      S0148   19  Female     11                   91.0        65.0

     Science_Score  English_Score  Final_Percentage
0             40.0           72.0             50.33
1             44.0           35.0             53.00
2             73.0           59.0             71.67
3             40.0           77.0             64.33
4             40.0           36.0             41.00
..             ...            ...               ...
143           40.0           82.0             64.33
144           40.0           97.0             93.00
145           48.0           44.0             47.67
146           56.0           50.0             67.33
147           51.0           65.0             60.33

[148 rows x 9 columns]

In [62]:
df = pd.read_csv('student_performance.csv')
df['Math_Score'] = df['Math_Score'].fillna(df['Math_Score'].mean())
# here we are replacing null values in the Math_Score column with the mean of the Math_Score column
df

,Student_ID,Age,Gender,Class,Attendance_Percentage,Math_Score,Science_Score,English_Score,Final_Percentage
0,S0001,15,Male,12,65.0,68.730769,NaN,72.0,50.33
1,S0002,19,Female,9,58.0,80.000000,44.0,35.0,53.00
2,S0003,14,Female,12,NaN,83.000000,73.0,59.0,71.67
3,S0004,18,Female,9,68.0,68.000000,NaN,77.0,64.33
4,S0005,14,Male,10,80.0,41.000000,NaN,36.0,41.00
...,...,...,...,...,...,...,...,...,...
143,S0144,14,Male,11,94.0,68.730769,NaN,82.0,64.33
144,S0145,19,Male,12,56.0,83.000000,NaN,97.0,93.00
145,S0146,19,Female,12,NaN,51.000000,48.0,44.0,47.67
146,S0147,19,Male,11,54.0,96.000000,56.0,50.0,67.33
147,S0148,19,Female,11,91.0,65.000000,51.0,65.0,60.33

In [63]:
# this is alternative way to replace null values in the specific column with the mean of that specific column 
# but this is only applicable when you are doing for one column if you want to do for multiple columns then you can use the first method
df.fillna({'Math_Score': df['Math_Score'].mean()}, inplace=True)

,Student_ID,Age,Gender,Class,Attendance_Percentage,Math_Score,Science_Score,English_Score,Final_Percentage
0,S0001,15,Male,12,65.0,68.730769,NaN,72.0,50.33
1,S0002,19,Female,9,58.0,80.000000,44.0,35.0,53.00
2,S0003,14,Female,12,NaN,83.000000,73.0,59.0,71.67
3,S0004,18,Female,9,68.0,68.000000,NaN,77.0,64.33
4,S0005,14,Male,10,80.0,41.000000,NaN,36.0,41.00
...,...,...,...,...,...,...,...,...,...
143,S0144,14,Male,11,94.0,68.730769,NaN,82.0,64.33
144,S0145,19,Male,12,56.0,83.000000,NaN,97.0,93.00
145,S0146,19,Female,12,NaN,51.000000,48.0,44.0,47.67
146,S0147,19,Male,11,54.0,96.000000,56.0,50.0,67.33
147,S0148,19,Female,11,91.0,65.000000,51.0,65.0,60.33

In [64]:
df['Science_Score'] = df['Science_Score'].fillna(df['Science_Score'].median())
df

,Student_ID,Age,Gender,Class,Attendance_Percentage,Math_Score,Science_Score,English_Score,Final_Percentage
0,S0001,15,Male,12,65.0,68.730769,71.0,72.0,50.33
1,S0002,19,Female,9,58.0,80.000000,44.0,35.0,53.00
2,S0003,14,Female,12,NaN,83.000000,73.0,59.0,71.67
3,S0004,18,Female,9,68.0,68.000000,71.0,77.0,64.33
4,S0005,14,Male,10,80.0,41.000000,71.0,36.0,41.00
...,...,...,...,...,...,...,...,...,...
143,S0144,14,Male,11,94.0,68.730769,71.0,82.0,64.33
144,S0145,19,Male,12,56.0,83.000000,71.0,97.0,93.00
145,S0146,19,Female,12,NaN,51.000000,48.0,44.0,47.67
146,S0147,19,Male,11,54.0,96.000000,56.0,50.0,67.33
147,S0148,19,Female,11,91.0,65.000000,51.0,65.0,60.33

In [65]:
df['English_Score'] = df['English_Score'].fillna(df['English_Score'].mode())
df

,Student_ID,Age,Gender,Class,Attendance_Percentage,Math_Score,Science_Score,English_Score,Final_Percentage
0,S0001,15,Male,12,65.0,68.730769,71.0,72.0,50.33
1,S0002,19,Female,9,58.0,80.000000,44.0,35.0,53.00
2,S0003,14,Female,12,NaN,83.000000,73.0,59.0,71.67
3,S0004,18,Female,9,68.0,68.000000,71.0,77.0,64.33
4,S0005,14,Male,10,80.0,41.000000,71.0,36.0,41.00
...,...,...,...,...,...,...,...,...,...
143,S0144,14,Male,11,94.0,68.730769,71.0,82.0,64.33
144,S0145,19,Male,12,56.0,83.000000,71.0,97.0,93.00
145,S0146,19,Female,12,NaN,51.000000,48.0,44.0,47.67
146,S0147,19,Male,11,54.0,96.000000,56.0,50.0,67.33
147,S0148,19,Female,11,91.0,65.000000,51.0,65.0,60.33

# TASK
HERE IS ANOTHER DATA FILE (laptop_prices.csv) DO THE SAME EXAMPLES BELOW WHICH I HAVE DONE ABOVE FOR BETTER PRACTICE

In [66]:
import pandas as pd
df = pd.read_csv('laptop_prices.csv')
print(df.head())

   laptop_ID Company      Product   TypeName  Inches  \
0          1   Apple  MacBook Pro  Ultrabook    13.3
1          2   Apple  Macbook Air  Ultrabook    13.3
2          3      HP       250 G6   Notebook    15.6
3          4   Apple  MacBook Pro  Ultrabook    15.4
4          5   Apple  MacBook Pro  Ultrabook    13.3

                     ScreenResolution                         Cpu   Ram  \
0  IPS Panel Retina Display 2560x1600        Intel Core i5 2.3GHz   8GB
1                            1440x900        Intel Core i5 1.8GHz   8GB
2                   Full HD 1920x1080  Intel Core i5 7200U 2.5GHz   8GB
3  IPS Panel Retina Display 2880x1800        Intel Core i7 2.7GHz  16GB
4  IPS Panel Retina Display 2560x1600        Intel Core i5 3.1GHz   8GB

                Memory                           Gpu  OpSys  Weight  \
0            128GB SSD  Intel Iris Plus Graphics 640  macOS  1.37kg
1  128GB Flash Storage        Intel HD Graphics 6000  macOS  1.34kg
2            256GB SSD         Intel HD Graphics 620  No OS  1.86kg
3            512GB SSD            AMD Radeon Pro 455  macOS  1.83kg
4            256GB SSD  Intel Iris Plus Graphics 650  macOS  1.37kg

   Price_euros
0      1339.69
1       898.94
2       575.00
3      2537.45
4      1803.60